src/cf/BusinessProcesses/ОзнакомлениеСОбращениемГО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<BusinessProcess>
		<Properties>
			<Name>ОзнакомлениеСОбращениемГО</Name>
			<Task>Task.ЗадачиГО</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Аннулировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоЗаявкаУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/cf/BusinessProcesses/ОзнакомлениеСОбращениемГО/Ext/ObjectModule.bsl
Процедура АннулироватьПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Аннулировать;
КонецПроцедуры

Процедура ЭтоЗаявкаУКПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ЭтоЗаявкаУК;
КонецПроцедуры

Процедура ОтправкаУведомленияВДругуюСистемуОбработка(ТочкаМаршрутаБизнесПроцесса)
	ОтправитьОповещение("Прием заявки УК");	
КонецПроцедуры 

Процедура ОтправитьОповещение(Текст)
	
	СоединениеHTTP = Новый HTTPСоединение("api.telegram.org",443,,,,,Новый ЗащищенноеСоединениеOpenSSL());

	АдресЗапроса = "bot1618335423:AAGOE4ZuhJ4rycaRyDeKtBEROre8_JsTShE/sendMessage?chat_id=1139990117&text="+Текст;
	ЗапросHTTP = Новый HTTPЗапрос(АдресЗапроса);

	Попытка
		СоединениеHTTP.Получить(ЗапросHTTP);             
	Исключение
		Возврат;
	КонецПопытки;

КонецПроцедуры 

Процедура ОзнакомлениеСОбращениемПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Секретарь");
	Для каждого Строка Из ФормируемыеЗадачи Цикл	
	    Строка.Пользователь = Пользователь;
		Строка.Аннулировать = Аннулировать;
		Строка.ЭтоЗаявкаУК = ЭтоЗаявкаУК;
		Строка.Телефон = Телефон;
		Строка.Дом = Дом;
		Строка.НомерКвартиры = НомерКвартиры;
		Строка.Почта = Почта;
		Строка.ФИО = ФИО;
		Строка.Описание = Описание;
	КонецЦикла;
КонецПроцедуры

Процедура ОзнакомлениеСОбращениемПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
КонецПроцедуры

Процедура ЗаявкаНаУстранениеГОПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)

	Пользователь = Справочники.Пользователи.НайтиПоНаименованию("Служба ГО");
	Для каждого Строка Из ФормируемыеЗадачи Цикл	
	    Строка.Пользователь = Пользователь;
		Строка.Аннулировать = Аннулировать;
		Строка.ЭтоЗаявкаУК = ЭтоЗаявкаУК;
		Строка.Телефон = Телефон;
		Строка.Дом = Дом;
		Строка.НомерКвартиры = НомерКвартиры;
		Строка.Почта = Почта;
		Строка.ФИО = ФИО;
		Строка.Описание = Описание;
	КонецЦикла;

КонецПроцедуры

Процедура ОзнакомлениеСОбращениемПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Аннулировать = Задача.Аннулировать;
	ЭтоЗаявкаУК = Задача. ЭтоЗаявкаУК;
КонецПроцедуры
